# Data Exploration and SQL Processing

This notebook focuses on the initial exploration of the California Housing dataset and the fundamental data processing using SQL. We will perform various SQL queries to gain insights into the data, identify essential features, and conduct some basic data cleaning.

The dataset has been loaded into a SQLite database to enable SQL querying. SQLite is a lightweight disk-based database that doesn't require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language.

In [1]:
# Importing necessary libraries
import pandas as pd
import sqlite3
from matplotlib import pyplot as plt
import seaborn as sns

# Loading the dataset
df = pd.read_csv('housing.csv')

# Establishing SQLite connection
conn = sqlite3.connect('HousingData.db')

# Loading the DataFrame into SQL database
df.to_sql('housing', conn, if_exists='replace')

20640

We have started by importing the necessary Python libraries, including pandas, sqlite3, matplotlib, and seaborn. Pandas is for data manipulation, sqlite3 is for interacting with the SQLite database, matplotlib and seaborn are for data visualization.

Next, we loaded the California Housing dataset into a pandas DataFrame and established a connection to a SQLite database. We then loaded the DataFrame into the SQLite database, replacing any existing table with the same name.

With the data loaded into the SQLite database, we can now perform SQL queries for data exploration and processing. Our primary focus will be using various SQL commands and techniques to gain a thorough understanding of the dataset and prepare it for further processing and modeling in the subsequent notebooks.

In [2]:
# SQL query to display the first 5 rows of the dataset
query = """
SELECT *
FROM housing
LIMIT 5
"""

# Execute the query
df_sample = pd.read_sql_query(query, conn)
df_sample

,index,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

This SQL query is used to display the first 5 rows from the 'housing' table. The SELECT statement is used to select data from a database, and the asterisk (*) is used to select all columns. The LIMIT clause is used to constrain the number of rows returned by the query.

In [3]:
# SQL query to get the information about the 'housing' table
query = """
PRAGMA table_info(housing);
"""

# Execute the query
table_info = pd.read_sql_query(query, conn)
table_info

    cid                name     type  notnull dflt_value  pk
0     0               index  INTEGER        0       None   0
1     1           longitude     REAL        0       None   0
2     2            latitude     REAL        0       None   0
3     3  housing_median_age     REAL        0       None   0
4     4         total_rooms     REAL        0       None   0
5     5      total_bedrooms     REAL        0       None   0
6     6          population     REAL        0       None   0
7     7          households     REAL        0       None   0
8     8       median_income     REAL        0       None   0
9     9  median_house_value     REAL        0       None   0
10   10     ocean_proximity     TEXT        0       None   0

The PRAGMA statement is specific to SQLite, and 'table_info' is used to retrieve metadata about a table, such as column names, data types, whether a column can be NULL, and so on.

In [4]:
# SQL query to find the number of NULL values in each column
query = """
SELECT
    SUM(CASE WHEN longitude IS NULL THEN 1 ELSE 0 END) AS Missing_Longitude,
    SUM(CASE WHEN latitude IS NULL THEN 1 ELSE 0 END) AS Missing_Latitude,
    SUM(CASE WHEN housing_median_age IS NULL THEN 1 ELSE 0 END) AS Missing_Housing_Median_Age,
    SUM(CASE WHEN total_rooms IS NULL THEN 1 ELSE 0 END) AS Missing_Total_Rooms,
    SUM(CASE WHEN total_bedrooms IS NULL THEN 1 ELSE 0 END) AS Missing_Total_Bedrooms,
    SUM(CASE WHEN population IS NULL THEN 1 ELSE 0 END) AS Missing_Population,
    SUM(CASE WHEN households IS NULL THEN 1 ELSE 0 END) AS Missing_Households,
    SUM(CASE WHEN median_income IS NULL THEN 1 ELSE 0 END) AS Missing_Median_Income,
    SUM(CASE WHEN median_house_value IS NULL THEN 1 ELSE 0 END) AS Missing_Median_House_Value
FROM
    housing
"""

# Execute the query
missing_values = pd.read_sql_query(query, conn)
missing_values

,Missing_Longitude,Missing_Latitude,Missing_Housing_Median_Age,Missing_Total_Rooms,Missing_Total_Bedrooms,Missing_Population,Missing_Households,Missing_Median_Income,Missing_Median_House_Value
0,0,0,0,0,207,0,0,0,0

In the above SQL query, we are checking for missing (NULL) values in each column of the 'housing' table. We use the SUM function along with a CASE statement to count the number of NULL values for each column.

In [5]:
# SQL query to get basic statistics for numerical columns
query = """
SELECT
    MIN(longitude) as Min_Longitude,
    MAX(longitude) as Max_Longitude,
    AVG(longitude) as Avg_Longitude,
    MIN(latitude) as Min_Latitude,
    MAX(latitude) as Max_Latitude,
    AVG(latitude) as Avg_Latitude,
    MIN(housing_median_age) as Min_Housing_Median_Age,
    MAX(housing_median_age) as Max_Housing_Median_Age,
    AVG(housing_median_age) as Avg_Housing_Median_Age,
    MIN(total_rooms) as Min_Total_Rooms,
    MAX(total_rooms) as Max_Total_Rooms,
    AVG(total_rooms) as Avg_Total_Rooms,
    MIN(total_bedrooms) as Min_Total_Bedrooms,
    MAX(total_bedrooms) as Max_Total_Bedrooms,
    AVG(total_bedrooms) as Avg_Total_Bedrooms,
    MIN(population) as Min_Population,
    MAX(population) as Max_Population,
    AVG(population) as Avg_Population,
    MIN(households) as Min_Households,
    MAX(households) as Max_Households,
    AVG(households) as Avg_Households,
    MIN(median_income) as Min_Median_Income,
    MAX(median_income) as Max_Median_Income,
    AVG(median_income) as Avg_Median_Income,
    MIN(median_house_value) as Min_Median_House_Value,
    MAX(median_house_value) as Max_Median_House_Value,
    AVG(median_house_value) as Avg_Median_House_Value
FROM
    housing
"""

# Execute the query
stats = pd.read_sql_query(query, conn)
stats

,Min_Longitude,Max_Longitude,Avg_Longitude,Min_Latitude,Max_Latitude,Avg_Latitude,Min_Housing_Median_Age,Max_Housing_Median_Age,Avg_Housing_Median_Age,Min_Total_Rooms,...,Avg_Population,Min_Households,Max_Households,Avg_Households,Min_Median_Income,Max_Median_Income,Avg_Median_Income,Min_Median_House_Value,Max_Median_House_Value,Avg_Median_House_Value
0,-124.35,-114.31,-119.569704,32.54,41.95,35.631861,1.0,52.0,28.639486,2.0,...,1425.476744,1.0,6082.0,499.53968,0.4999,15.0001,3.870671,14999.0,500001.0,206855.816909

In this SQL query, we are generating basic statistical measures such as minimum, maximum, average for each of the numerical columns in the 'housing' table. We use the MIN, MAX, and AVG functions provided by SQL to compute these statistics.

In [6]:
# SQL query to find the unique values in the 'housing_median_age' column
query = """
SELECT DISTINCT housing_median_age
FROM housing
ORDER BY housing_median_age
"""

# Execute the query
unique_values = pd.read_sql_query(query, conn)
unique_values

    housing_median_age
0                  1.0
1                  2.0
2                  3.0
3                  4.0
4                  5.0
5                  6.0
6                  7.0
7                  8.0
8                  9.0
9                 10.0
10                11.0
11                12.0
12                13.0
13                14.0
14                15.0
15                16.0
16                17.0
17                18.0
18                19.0
19                20.0
20                21.0
21                22.0
22                23.0
23                24.0
24                25.0
25                26.0
26                27.0
27                28.0
28                29.0
29                30.0
30                31.0
31                32.0
32                33.0
33                34.0
34                35.0
35                36.0
36                37.0
37                38.0
38                39.0
39                40.0
40                41.0
41                42.0
42                43.0
43                44.0
44                45.0
45                46.0
46                47.0
47                48.0
48                49.0
49                50.0
50                51.0
51                52.0

In the above SQL query, we use the DISTINCT keyword to find unique values in the 'housing_median_age' column. We also use the ORDER BY clause to sort the result.

In [7]:
# SQL query to find the average median house value for each housing median age
query = """
SELECT
    housing_median_age,
    AVG(median_house_value) as Avg_Median_House_Value
FROM
    housing
GROUP BY
    housing_median_age
ORDER BY
    housing_median_age
"""

# Execute the query
age_vs_value = pd.read_sql_query(query, conn)
age_vs_value

    housing_median_age  Avg_Median_House_Value
0                  1.0           144300.000000
1                  2.0           224475.913793
2                  3.0           235643.580645
3                  4.0           229235.136126
4                  5.0           208417.655738
5                  6.0           203794.393750
6                  7.0           193296.034286
7                  8.0           194414.582524
8                  9.0           186672.702439
9                 10.0           176580.704545
10                11.0           179907.901575
11                12.0           182046.235294
12                13.0           190181.807947
13                14.0           189597.104369
14                15.0           181808.416016
15                16.0           200180.562905
16                17.0           190494.289398
17                18.0           193354.766667
18                19.0           193197.838645
19                20.0           195659.815054
20                21.0           200156.535874
21                22.0           209897.558897
22                23.0           204554.741071
23                24.0           205833.098326
24                25.0           220414.180212
25                26.0           209475.316640
26                27.0           208296.973361
27                28.0           208158.866242
28                29.0           197227.800434
29                30.0           200252.560924
30                31.0           207084.117904
31                32.0           203410.141593
32                33.0           203628.175610
33                34.0           214593.962264
34                35.0           207298.950243
35                36.0           207573.943155
36                37.0           207360.772812
37                38.0           193593.695431
38                39.0           208890.560976
39                40.0           208918.483553
40                41.0           197253.773649
41                42.0           198772.603261
42                43.0           193639.135977
43                44.0           216233.471910
44                45.0           217798.020408
45                46.0           200784.934694
46                47.0           190601.050505
47                48.0           222571.807910
48                49.0           220335.880597
49                50.0           217880.242647
50                51.0           227718.833333
51                52.0           275420.871170

This SQL query calculates the average median house value for each value of housing median age. The GROUP BY statement is used to group rows that have the same values in specified columns into aggregated data. The AVG function is then applied to each group. The ORDER BY clause is used to sort the result.

In [10]:
# SQL query to find the median number of total rooms for each income category
query = """
SELECT
    CASE
        WHEN median_income <= 1.5 THEN 'Low'
        WHEN median_income > 1.5 AND median_income <= 3.0 THEN 'Medium'
        WHEN median_income > 3.0 AND median_income <= 4.5 THEN 'High'
        ELSE 'Very High'
    END AS income_category,
    AVG(total_rooms) as Median_Total_Rooms
FROM
    housing
GROUP BY
    income_category
ORDER BY
    Median_Total_Rooms DESC
"""

# Execute the query
income_vs_rooms = pd.read_sql_query(query, conn)
income_vs_rooms

  income_category  Median_Total_Rooms
0       Very High         3238.823863
1            High         2697.768104
2          Medium         2167.006686
3             Low         1440.203163

In this SQL query, we use the CASE statement to create income categories based on the 'median_income' column. Then, we group by the income category and find the average of 'total_rooms' in each category. Finally, we sort the result in descending order by the average number of total rooms.

In [11]:
# SQL query to find the area with the highest and lowest median income
query = """
SELECT
    latitude,
    longitude,
    median_income
FROM
    housing
WHERE
    median_income = (SELECT MAX(median_income) FROM housing)
    OR median_income = (SELECT MIN(median_income) FROM housing)
"""

# Execute the query
extreme_income_areas = pd.read_sql_query(query, conn)
extreme_income_areas

    latitude  longitude  median_income
0      37.81    -122.29         0.4999
1      37.74    -121.96        15.0001
2      36.09    -119.99         0.4999
3      39.42    -122.89         0.4999
4      34.10    -118.37        15.0001
..       ...        ...            ...
56     37.19    -121.59        15.0001
57     37.13    -121.96        15.0001
58     37.65    -121.01         0.4999
59     40.43    -123.32         0.4999
60     38.07    -120.19         0.4999

[61 rows x 3 columns]

This SQL query finds the areas (latitude, longitude) with the highest and lowest median income. We use subqueries to find the maximum and minimum 'median_income', and get the corresponding 'latitude' and 'longitude'.

In [12]:
# SQL query to find the median house value per latitude and longitude
query = """
SELECT
    latitude,
    longitude,
    AVG(median_house_value) as Average_Median_House_Value
FROM
    housing
GROUP BY
    latitude, longitude
ORDER BY
    Average_Median_House_Value DESC
LIMIT 10
"""

# Execute the query
geo_value = pd.read_sql_query(query, conn)
geo_value

   latitude  longitude  Average_Median_House_Value
0     32.68    -117.18                    500001.0
1     32.71    -117.24                    500001.0
2     32.76    -117.19                    500001.0
3     32.81    -117.29                    500001.0
4     32.82    -117.31                    500001.0
5     32.82    -117.26                    500001.0
6     32.83    -117.31                    500001.0
7     32.83    -117.26                    500001.0
8     32.83    -117.25                    500001.0
9     32.84    -117.25                    500001.0

This SQL query calculates the average median house value for each geographic location (latitude and longitude). We use the GROUP BY statement to group rows that have the same geographic location. Then, we sort the result in descending order by the average median house value. We also use the LIMIT clause to limit the output to the top 10 results.

In [13]:
# SQL query to find the number of entries for each unique value of housing median age
query = """
SELECT
    housing_median_age,
    COUNT(*) as Number_of_entries
FROM
    housing
GROUP BY
    housing_median_age
ORDER BY
    Number_of_entries DESC
"""

# Execute the query
age_entries = pd.read_sql_query(query, conn)
age_entries

    housing_median_age  Number_of_entries
0                 52.0               1273
1                 36.0                862
2                 35.0                824
3                 16.0                771
4                 17.0                698
5                 34.0                689
6                 26.0                619
7                 33.0                615
8                 18.0                570
9                 25.0                566
10                32.0                565
11                37.0                537
12                15.0                512
13                19.0                502
14                27.0                488
15                24.0                478
16                30.0                476
17                28.0                471
18                20.0                465
19                29.0                461
20                31.0                458
21                23.0                448
22                21.0                446
23                14.0                412
24                22.0                399
25                38.0                394
26                39.0                369
27                42.0                368
28                44.0                356
29                43.0                353
30                40.0                304
31                13.0                302
32                41.0                296
33                45.0                294
34                10.0                264
35                11.0                254
36                46.0                245
37                 5.0                244
38                12.0                238
39                 8.0                206
40                 9.0                205
41                47.0                198
42                 4.0                191
43                48.0                177
44                 7.0                175
45                 6.0                160
46                50.0                136
47                49.0                134
48                 3.0                 62
49                 2.0                 58
50                51.0                 48
51                 1.0                  4

In this SQL query, we use the COUNT function to calculate the number of entries for each unique value of 'housing_median_age'. We use the GROUP BY statement to group rows that have the same value of 'housing_median_age'. Finally, we sort the result in descending order by the number of entries.

In [14]:
# SQL query to find the distribution of median house values across different age groups
query = """
SELECT
    CASE
        WHEN housing_median_age <= 10 THEN '0-10'
        WHEN housing_median_age > 10 AND housing_median_age <= 20 THEN '10-20'
        WHEN housing_median_age > 20 AND housing_median_age <= 30 THEN '20-30'
        WHEN housing_median_age > 30 AND housing_median_age <= 40 THEN '30-40'
        ELSE '40+'
    END AS age_group,
    AVG(median_house_value) as Average_Median_House_Value
FROM
    housing
GROUP BY
    age_group
ORDER BY
    Average_Median_House_Value DESC
"""

# Execute the query
age_value_distribution = pd.read_sql_query(query, conn)
age_value_distribution

  age_group  Average_Median_House_Value
0       40+               228965.009025
1     20-30               206801.590478
2     30-40               206662.165747
3      0-10               200263.254939
4     10-20               191181.627223

In this SQL query, we use the CASE statement to divide the houses into age groups. Then, we calculate the average median house value for each age group, group the results by the age group, and order by the average median house value in descending order.

In [15]:
# SQL query to find the median house value for different income groups
query = """
SELECT
    CASE
        WHEN median_income <= 2 THEN 'Low'
        WHEN median_income > 2 AND median_income <= 4 THEN 'Medium'
        ELSE 'High'
    END AS income_group,
    AVG(median_house_value) as Average_Median_House_Value
FROM
    housing
GROUP BY
    income_group
ORDER BY
    Average_Median_House_Value DESC
"""

# Execute the query
income_value_distribution = pd.read_sql_query(query, conn)
income_value_distribution

  income_group  Average_Median_House_Value
0         High               283783.597255
1       Medium               168199.345880
2          Low               112497.156695

In this SQL query, we use the CASE statement to divide the dataset into income groups. Then, we calculate the average median house value for each income group, group the results by the income group, and order by the average median house value in descending order.

In [17]:
# SQL query to find the average median_house_value for different groups of total_rooms
query = """
SELECT
    CASE
        WHEN total_rooms <= 2 THEN '0-2'
        WHEN total_rooms > 2 AND total_rooms <= 4 THEN '2-4'
        WHEN total_rooms > 4 AND total_rooms <= 6 THEN '4-6'
        ELSE '6+'
    END AS rooms_group,
    AVG(median_house_value) as Average_Median_House_Value
FROM
    housing
GROUP BY
    rooms_group
ORDER BY
    Average_Median_House_Value DESC
"""

# Execute the query
rooms_value_distribution = pd.read_sql_query(query, conn)
rooms_value_distribution

  rooms_group  Average_Median_House_Value
0          6+               206866.535565
1         0-2               137500.000000
2         4-6                55000.000000

In this SQL query, we use the CASE statement to divide the dataset into groups based on the number of total rooms. Then, we calculate the average median house value for each group, group the results by the number of rooms, and order by the average median house value in descending order.

# Summary
Throughout this notebook, we have performed an exploratory analysis of the California housing dataset using SQL queries in Python. We started by loading the data into a SQLite database, which allowed us to run SQL queries directly from our Python environment.

We've used a variety of SQL queries to gain insights about our data, including:

- Basic queries to inspect the structure and content of the dataset.
- Queries that use aggregate functions like COUNT and AVG to compute statistics about the data.
- Queries that use grouping and ordering to segment the data and reveal trends.
- A query that uses the correlation function to find the relationship between two features.

These queries helped us understand the underlying structure of our data, and allowed us to answer several business-oriented questions. The insights gained from this exploratory analysis can be used to guide further data processing and modeling.

# Business Summary
The results of this analysis can provide valuable insights for investors in the Californian real estate market. For example, we have noticed that houses in different income groups and age groups have different median values. These differences can influence investment strategies, such as investing in properties in specific income or age groups.

Our exploration also revealed the average house values across different groups of total rooms. These insights can suggest how property characteristics such as the number of rooms might influence their value, and can be particularly useful for real estate developers when planning new builds.

In summary, an analysis like this, conducted at the start of a data-related project, is necessary to gain a thorough understanding of the data and how it can be used to obtain business value. In the following notebooks, we will continue the data processing and modeling process, keeping these initial findings in mind.